// TASK 1 --------------------------------------------------------------------------------------------------------------

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// const number = Number(prompt('Введіть число'));
// const number = +prompt('Введіть число');
// const number = 1 * prompt('Введіть число');

// SOLVING --------------------------------------------------------------------------------------------------------------

// if (number === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

// number === 10 ? alert('Вірно') : alert('Невірно');

// alert(number === 10 ? 'Вірно' : 'Невірно');

// TASK 2 --------------------------------------------------------------------------------------------------------------

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// SOLVING --------------------------------------------------------------------------------------------------------------

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// 59 = max number
// 0 = min number

// if (min <= 15) {
//   alert(`${min} входить у першу чверть`);
// } else if (min <= 30) {
//   alert(`${min} входить у першу чверть`);
// } else if (min <= 45) {
//   alert(`${min} входить у першу чверть`);
// } else {
//   alert(`${min} входить у першу чверть`);
// }

// TASK 3 --------------------------------------------------------------------------------------------------------------

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// SOLVING --------------------------------------------------------------------------------------------------------------

// const num = Number(prompt('Запишіть значення'));

// let result;

// switch (num) {
//   case 1:
//     result = 'Зима';
//     break;
//   case 2:
//     result = 'Весна';
//     break;
//   case 3:
//     result = 'Літо';
//     break;
//   case 4:
//     result = 'Осінь';
// break;

//   default:
//     result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
//     break;
// }

// console.log(result);

// TASK 4 --------------------------------------------------------------------------------------------------------------

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples

// SOLVING --------------------------------------------------------------------------------------------------------------

// const minutes = Number(prompt('Введіть кількість хвилин'));

// const hours = Math.floor(minutes / 60);

// const normalizedMinutes = minutes % 60;

// console.log(`${hours}:${normalizedMinutes}`);

// TASK 5 --------------------------------------------------------------------------------------------------------------

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// SOLVING --------------------------------------------------------------------------------------------------------------

// TASK 6 --------------------------------------------------------------------------------------------------------------

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// SOLVING --------------------------------------------------------------------------------------------------------------

// TASK 7 --------------------------------------------------------------------------------------------------------------

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// SOLVING --------------------------------------------------------------------------------------------------------------

// function getNumbers(min, max) {
//   let total = 0;

//   for (let i = max; i >= min; i--) {
//     if (i % 2 === 0) {
//       total += i;
//     }
//   }
//   return total;
// }

// console.log(getNumbers(10, 30));

// TASK 8 --------------------------------------------------------------------------------------------------------------

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// SOLVING --------------------------------------------------------------------------------------------------------------

// function min(a, b) {
//   if (typeof a !== 'number' || typeof b !== 'number') {
//     return 'Not a Number!';
//   }

// if (a < b) {
//   return a;
// } else {
//   return b;
// }

// return a < b ? a : b;

//   return Math.min(a, b);
// }

// console.log(min(11, 10));
// console.log(min(11, 25));
// console.log(min('false', 49));

// TASK 9 --------------------------------------------------------------------------------------------------------------

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// SOLVING --------------------------------------------------------------------------------------------------------------

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     const checkAge = confirm('Are you an adult?');
//     return checkAge;

//     //   return confirm('Are you an adult?');
//   }
// }

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   return confirm('Are you an adult?');
// }

// function isAdult(age) {
//   return age >= 18 ? true : confirm('Are you an adult?');
// }

// function isAdult(age) {
//   return age >= 18 || confirm('Are you an adult?');
// }

// console.log(isAdult(15));

// TASK 10 --------------------------------------------------------------------------------------------------------------

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// SOLVING --------------------------------------------------------------------------------------------------------------

// function fizzBuzz(num) {
//   for (let i = 1; i <= num; i++) {
//     if (i % 3 === 0 && i % 5 === 0) {
//       console.log('fizzbuzz');
//     } else if (i % 3 === 0) {
//       console.log('fizz');
//     } else if (i % 5 === 0) {
//       console.log('buzz');
//     } else {
//       console.log(i);
//     }
//   }
// }

// fizzBuzz(7);
// fizzBuzz(16);
// fizzBuzz(26);
