// TASK 1 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Дано масив чисел [1, 2, 3, 4, 5]. Створіть новий масив, що містить
// квадрати кожного елементу вхідного масиву.
// Очікуваний результат: [1, 4, 9, 16, 25].

// const numbers = [1, 2, 3, 4, 5];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const doubleNumbers = numbers.map(number => {
//   return number ** 2});
// console.log('🚀 ~ doubleNumbers:', doubleNumbers);

// const doubleNumbers = numbers.map(number => number ** 2);
// console.log('🚀 ~ doubleNumbers:', doubleNumbers);

// const getDoubleNumbers = array => array.map(number => number ** 2);

// console.log(getDoubleNumbers(numbers));
// console.log(getDoubleNumbers([10, 20, 30]));
// console.log(getDoubleNumbers([5, 25, 125]));

// TASK 2 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Дано масив об'єктів. Створіть новий масив, що містить всі значення
// з масивів values кожного об'єкту, збережених в одному масиві.
// Очікуваний результат: [1, 2, 3, 4, 5, 6, 7, 8, 9].

// const data = [
//   { id: 1, values: [1, 2, 3] },
//   { id: 2, values: [4, 5, 6] },
//   { id: 3, values: [7, 8, 9] },
// ];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const allValues = data.flatMap(item => item.values);
// console.log('🚀 ~ allValues:', allValues);

// const getAllValues = array => array.flatMap(item => item.values);
// console.log(getAllValues(data));

// TASK 3 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Дано масив об'єктів.
// Перевірте, чи є хоча б один об'єкт з віком менше 20 років.
// Очікуваний результат: true.

// const people = [
//   { name: 'John', age: 27 },
//   { name: 'Jane', age: 31 },
//   { name: 'Bob', age: 19 },
// ];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const personAge = people.some(person => person.age < 20);
// console.log('🚀 ~ personAge:', personAge);

// const checkPersonAge = array => array.some(person => person.age < 20);
// console.log(checkPersonAge(people));

// TASK 4 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Дано масив чисел [2, 4, 6, 8, 10].
// Перевірте, чи є кожен елемент масиву парним. Очікуваний результат: true.

// const numbers = [2, 4, 6, 8, 10];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const evenNumbers = numbers.every(number => number % 2 === 0);
// console.log('🚀 ~ evenNumbers:', evenNumbers);

// const getEvenNumbers = array => array.every(number => number % 2 === 0);
// console.log(getEvenNumbers(numbers));

// TASK 5 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Знайдіть перше непарне число

// const numbers = [2, 1, 6, 8, 9, 10, 12];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const oddNumber = numbers.find(number => number % 2 !== 0);
// console.log('🚀 ~ oddNumber:', oddNumber);

// const getOddNumber = array => array.find(number => number % 2 !== 0);
// console.log(getOddNumber(numbers));

// TASK 6 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Відсортуйте масив чисел [4, 2, 5, 1, 3]
// у порядку зростання. Очікуваний результат: [1, 2, 3, 4, 5].

// const numbersArray = [4, 2, 5, 1, 3];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const sortedNumbers = numbersArray.toSorted((a, b) => a - b);
// console.log('🚀 ~ sortedNumbers:', sortedNumbers);

// const getSortedNumbers = array => array.toSorted((a, b) => a - b);
// console.log(getSortedNumbers(numbersArray));

// TASK 7 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Відсортуйте масив рядків ["banana", "orange", "apple", "pear"]
//  у порядку алфавіту.
// Очікуваний результат: ["apple", "banana", "orange", "pear"].

// const stringArray = ['banana', 'orange', 'apple', 'pear'];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const sortedString = stringArray.toSorted((a, b) => a.localeCompare(b));
// console.log('🚀 ~ sortedString:', sortedString);

// const getSortedString = string => string.toSorted((a, b) => a.localeCompare(b));
// console.log(getSortedString(stringArray));

// TASK 8 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

//  Відсортуйте масив об'єктів за віком у порядку зростання.
// Очікуваний результат: [{name: "Bob", age: 19}, {name: "John", age: 27}, {name: "Jane", age: 31}].

// const users = [
//   { name: 'John', age: 27 },
//   { name: 'Jane', age: 31 },
//   { name: 'Bob', age: 19 },
// ];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const sortedUsers = users.toSorted((a, b) => a.age - b.age);
// console.log('🚀 ~ sortedUsers:', sortedUsers);

// const getSortedUsers = array => array.toSorted((a, b) => a.age - b.age);
// console.log(getSortedUsers(users));

// TASK 9 --------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------

// Дано масив об'єктів.
// Створіть новий масив, що містить тільки об'єкти, в яких
// вік більше 20 років.
// Очікуваний результат: [{name: "John", age: 27}, {name: "Jane", age: 31}]

// const users = [
//   { name: 'John', age: 27 },
//   { name: 'Jane', age: 31 },
//   { name: 'Bob', age: 19 },
// ];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const filteredUsers = users.filter(user => user.age > 20);
// console.log('🚀 ~ filteredUsers:', filteredUsers);

// const getFilteredUsers = array => array.filter(user => user.age > 20);
// console.log(getFilteredUsers(users));

// TASK 10 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

// Дано масив чисел [1, 2, 3, 4, 5].
// Застосуйте метод для обчислення суми елементів масиву.

// const numbers = [1, 2, 3, 4, 5];

// SOLVING --------------------------------------------------------------------------------------------------------------

// const numbersSummary = numbers.reduce((sum, number) => (sum + number), 0);
// console.log('🚀 ~ numbersSummary:', numbersSummary);

// const getNumbersSummary = array =>
//   array.reduce((sum, number) => (sum + number), 0);
// console.log(getNumbersSummary(numbers));

// TASK 11 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

// Розроби клас Calculator, який дозволяє виконувати арифметичні
// операції над числом за допомогою методів класу, підтримуючи
// ланцюжковий виклик (method chaining).
//
// Вимоги до класу Calculator
// - Метод number(value)
// Встановлює початкове значення для наступних обчислень.
// Повертає сам об'єкт (this) для підтримки ланцюжкових викликів.

// - метод getResult, Повертає поточний результат усіх операцій.
// Не змінює значення, просто повертає його.

// - метод add - Додає value до поточного значення.
// Повертає сам об'єкт (this) для підтримки ланцюжкових викликів.

// - метод substruct - Віднімає value від поточного значення. Повертає this.

// - метод divide - Ділить поточне значення на value, якщо value не дорівнює 0.
// Якщо value === 0, викидає помилку з повідомленням про неможливість ділення.
// Повертає сам об'єкт (this) для підтримки ланцюжкових викликів.

// - метод multiply -Множить поточне значення на value. Повертає this.

// Об'єкт класу може проводити послідовні операції у вигляді ланцюжка

// Приклад використання:
// const calc = new Calculator();

// const result = calc
// .number(10) // Встановлюємо початкове значення 10
// .add(5)   // Додаємо 5 (10 + 5 = 15)
// .subtract(3) // Віднімаємо 3 (15 - 3 = 12)
// .multiply(4) // Множимо на 4 (12 * 4 = 48)
// .divide(2)  // Ділимо на 2 (48 / 2 = 24)
// .getResult(); // Отримуємо результат: 24

// console.log(result); // 24

// SOLVING --------------------------------------------------------------------------------------------------------------

// class Calculator {
//   constructor() {
//     this.value = 0;
//   }

//   number(value) {
//     this.value = value;
//     return this;
//   }
//   getResult() {
//     return this.value;
//   }
//   add(value) {
//     this.value += value;
//     return this;
//   }
//   subtract(value) {
//     this.value -= value;
//     return this;
//   }
//   divide(value) {
//     value !== 0 ? (this.value /= value) : console.error('Incorrect operation!');
//     return this;
//   }
//   multiply(value) {
//     this.value *= value;
//     return this;
//   }
// }

// const calc = new Calculator();
// console.log('🚀 ~ calc:', calc);

// const result = calc
//   .number(10) // Встановлюємо початкове значення 10
//   .add(5) // Додаємо 5 (10 + 5 = 15)
//   .subtract(3) // Віднімаємо 3 (15 - 3 = 12)
//   .multiply(4) // Множимо на 4 (12 * 4 = 48)
//   .divide(2) // Ділимо на 2 (48 / 2 = 24)
//   .getResult(); // Отримуємо результат: 24

// console.log(result); // 24

// TASK 12 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

// Напиши клас Client який створює об'єкт з властивостями login email.
// Оголоси приватні властивості #login #email, доступ до яких зроби
// через геттер та сеттер login email

// SOLVING --------------------------------------------------------------------------------------------------------------

// class Client {
//   #login;
//   #email;

//   constructor(login, email) {
//     this.#login = login;
//     this.#email = email;
//   }

//   get login() {
//     return this.#login;
//   }

//   set login(newLogin) {
//     this.#login = newLogin;
//   }

//   get email() {
//     return this.#email;
//   }

//   set login(newEmail) {
//     this.#email = newEmail;
//   }
// }

// TASK 13 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

//  Наслідування у класах!
// Cтворіть клас `Person`, який містить наступні властивості:
//  - `name` - ім'я людини;
//  - `age`- вік людини;
//  - `gender` - стать людини;
//  - `email`- електронна пошта людини.

// Крім того, клас `Person` має мати метод `getDetails()`,
// який повертає об'єкт з ім'ям, віком, статтю
//та електронною поштою людини.

//
// Потім Створіть клас `Employee`, який розширює клас `Person` і містить наступні властивості:
//  - salary - зарплата співробітника;
//  - department - відділ, в якому працює співробітник.
// Крім того, клас `Employee` має мати метод `getEmployeeDetails()`, який повертає об'єкт з зарплатою співробітника та відділом, в якому він працює.

// SOLVING --------------------------------------------------------------------------------------------------------------

// class Person {
//   constructor(name, age, gender, email) {
//     this.name = name;
//     this.age = age;
//     this.gender = gender;
//     this.email = email;
//   }
//   getDetails() {
//     return {
//       name: this.name,
//       age: this.age,
//       gender: this.gender,
//       email: this.email,
//     };
//   }
// }

// class Employee extends Person {
//   constructor(name, age, gender, email, salary, department) {
//     super(name, age, gender, email);
//     this.salary = salary;
//     this.departmet = department;
//   }
//   getEmployeeDetails() {
//     const data = this.getDetails();
//     return { ...data, salary: this.salary, department: this.department };
//   }
// }

// TASK 14 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

// Напишіть функцію, яка розгортає масив у зворотному порядку.
// Будь ласка, не використовуйте array.reverse() або array.toSorted(), щоб зробити завдання цікавішим.

// const data = [10, 20, 30, 40, 50, 60];
// const alphData = ['a', 'b', 'c', 'd', 'e'];

// // SOLVING --------------------------------------------------------------------------------------------------------------

// function reverseArray(arr) {
//   return arr.reduce((acc, item) => {
//     acc.unshift(item);
//     return acc;
//   }, []);
// }

// console.log(reverseArray(data));
// console.log(reverseArray(alphData));

// TASK 15 --------------------------------------------------------------------------------------------------------------
// ----------------------------------------------------------------------------------------------------------------------

/**
 * Напиши клас Storage який створює об'єкти для керування складом товарів.
 * При виклику отримуватиме один аргумент - початковий масив товарів і
 * записуватиме його властивість items.
 *
 * Додай методи класу:
 * - getItems() - повертає масив товарів.
 * - addItem(item) - отримує новий товар і додає його до поточних.
 * - removeItem(item) - отримує товар і, якщо він є, видаляє його з поточних.
 */

// const storage = new Storage(['🍎', '🍋', '🍇', '🍑']);

// const items = storage.getItems();
// console.table(items); // [ '🍎', '🍋', '🍇', '🍑' ]

// storage.addItem('🍌');
// console.table(storage.items); // [ '🍎', '🍋', '🍇', '🍑', '🍌' ]

// storage.removeItem('🍋');
// console.table(storage.items); // [ '🍎', '🍇', '🍑', '🍌' ]

// SOLVING --------------------------------------------------------------------------------------------------------------

// class Storage {
//   constructor(items) {
//     this.items = items;
//   }
//   getItems() {
//     return this.items;
//   }
//   addItem(item) {
//     this.items.push(item);
//   }
//   removeItem(item) {
//     const itemIndex = this.items.indexOf(item);
//     if (itemIndex !== -1) {
//       this.items.splice(itemIndex, 1);
//     }
//   }
// }

// const storage = new Storage(['🍎', '🍋', '🍇', '🍑']);

// const items = storage.getItems();
// console.table(items); // [ '🍎', '🍋', '🍇', '🍑' ]

// storage.addItem('🍌');
// console.table(storage.items); // [ '🍎', '🍋', '🍇', '🍑', '🍌' ]

// storage.removeItem('🍋');
// console.table(storage.items); // [ '🍎', '🍇', '🍑', '🍌' ]
